InformationRegisters/СтатусыЗаказаПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаказаПокупателя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеЗаказаПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗаказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСобрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКПогрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличесвоНаДоставке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВыполнено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОжидается</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОтказКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОтказПоставщика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостояниеЗаказаПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостояниеЗаказаПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВПутиНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заказан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказаноПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарезервирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстекСрокРезервирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДоставке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодборе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетНаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКратности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подобрано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвежденПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступилоНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещенУПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Составлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаТакси</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныКорректировкиСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныКорректировкиСборки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пересорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстекСрокРезервирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКратности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ГрузовоеМесто.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ГрузовоеМесто</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сборка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Погружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неактуально_КорректировкаСборки</Name>
					<Comment>Документ неактуален вследствие корректировки сборки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаСборки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаСборкиЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияСамовывоза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШКОбособленного</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПечатиШтрихкода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихкодГрузовогоМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СтатусыЗаказаПокупателя/Ext/ManagerModule.bsl
Процедура УстановитьСтатусЗаказаПокупателя(ДанныхЗаписи)

	Попытка
		
		МенеджерЗаписи = РегистрыСведений.СтатусыЗаказаПокупателя.СоздатьМенеджерЗаписи(); 
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныхЗаписи);
		МенеджерЗаписи.Записать(); 
		
	Исключение
	КонецПопытки;

КонецПроцедуры	         

Процедура УдалитьЗаписиДокумента(ДокументЗаписи)

	Попытка
		
		НаборЗаписей = РегистрыСведений.СтатусыЗаказаПокупателя.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ДокументЗаписи);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
		
	Исключение
	КонецПопытки;

КонецПроцедуры	

Процедура ДобавитьЗаписьСтатусаЗаказа(ДокументЗаписи, Отказ, ОтменаЗаписи = Ложь) Экспорт

	Если ОтменаЗаписи Тогда 
		УдалитьЗаписиДокумента(ДокументЗаписи.Ссылка);
	Иначе 	 
		
		Если ТипЗнч(ДокументЗаписи.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") И НЕ ЕстьРазличияЗаписей(ДокументЗаписи.Ссылка) Тогда  
			Возврат;
		КонецЕсли;
		
		УдалитьЗаписиДокумента(ДокументЗаписи.Ссылка);
		
		ТаблицаДвижения = ПолучитьТаблицуДвиженияСтатуса(ДокументЗаписи.Ссылка);
		
		Для Каждого СтрокаДвижения Из ТаблицаДвижения Цикл
			УстановитьСтатусЗаказаПокупателя(СтрокаДвижения);	
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры	

Функция ПолучитьТаблицуДвиженияСтатуса(ДокументДвижения)

	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПоДокументу(ДокументДвижения);
	Запрос.Параметры.Вставить("ДокументДвижения", ДокументДвижения);
	
	ТаблицаДвижения = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДвижения;

КонецФункции	  

Функция ПолучитьТекстЗапросаПоДокументу(ДокументСсылка)

	ТекстЗапроса = "";

	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ТекстЗапроса = ПолучитьТекстЗапросаЗаказаПокупателя();
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		ТекстЗапроса = ПолучитьТекстЗапросаРеализацияТоваровУслуг();
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаЗаказаПокупателя") Тогда
		ТекстЗапроса = ПолучитьТекстЗапросаКорректировкаЗаказаПокупателя();
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ГрузовоеМесто") Тогда 
		ТекстЗапроса = ПолучитьТекстЗапросаГрузовоеМесто();		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СборкаЗаказовПокупателя") Тогда 
		ТекстЗапроса = ПолучитьТекстЗапросаСборкаЗаказовПокупателя();		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда  
		ТекстЗапроса = ПолучитьТекстЗапросаЗаказПоставщику();
	КонецЕсли;	
	
	Возврат ТекстЗапроса;

КонецФункции	

Функция ПолучитьТекстЗапросаЗаказаПокупателя()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТоварыДокумента.Ссылка КАК ЗаказПокупателя,
	|	ТоварыДокумента.Номенклатура,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка = &ДокументДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Ссылка,
	|	ТоварыДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыДокумента.ЗаказПокупателя,
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	ВТ_ТоварыДокумента.ЗаказПокупателя КАК Документ,
	|	Значение(Перечисление.СостояниеЗаказаПокупателя.Заказан) КАК Статус,
	|	ВТ_ТоварыДокумента.Количество КАК КоличествоЗаказано
	|ИЗ
	|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента";      
	
	Возврат ТекстЗапроса;

КонецФункции	

Функция ПолучитьТекстЗапросаРеализацияТоваровУслуг()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТоварыДокумента.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТоварыДокумента.Ссылка КАК Документ,
	|	ТоварыДокумента.Номенклатура,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка = &ДокументДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.ЗаказПокупателя,
	|	ТоварыДокумента.Ссылка,
	|	ТоварыДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыДокумента.ЗаказПокупателя,
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	ВТ_ТоварыДокумента.Документ КАК Документ,
	|	ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.Выполнен) КАК Статус,
	|	ВТ_ТоварыДокумента.Количество КАК КоличествоВыполнено
	|ИЗ
	|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента";     
	
	Возврат ТекстЗапроса;

КонецФункции	

Функция ПолучитьТекстЗапросаКорректировкаЗаказаПокупателя()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТоварыДокумента.Ссылка.ЗаказПокупателя КАК ЗаказПокупателя,
	               |	ТоварыДокумента.Ссылка КАК Документ,
	               |	ТоварыДокумента.Номенклатура,
	               |	ТоварыДокумента.Причина,
	               |	СУММА(ТоварыДокумента.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ТоварыДокумента
	               |ИЗ
	               |	Документ.КорректировкаЗаказаПокупателя.Товары КАК ТоварыДокумента
	               |ГДЕ
	               |	ТоварыДокумента.Ссылка = &ДокументДвижения
	               |	И (ТоварыДокумента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
	               |			ИЛИ ТоварыДокумента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыДокумента.Ссылка.ЗаказПокупателя,
	               |	ТоварыДокумента.Ссылка,
	               |	ТоварыДокумента.Причина,
	               |	ТоварыДокумента.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя,
	               |	ВТ_ТоварыДокумента.Номенклатура,
	               |	ВТ_ТоварыДокумента.Документ КАК Документ,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ВТ_ТоварыДокумента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
	               |				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.ОтказПокупателя)
	               |			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.ОтказПоставщика)
	               |		КОНЕЦ) КАК Статус,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТ_ТоварыДокумента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
	               |				ТОГДА ВТ_ТоварыДокумента.Количество * -1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КоличествоОтказКлиента,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТ_ТоварыДокумента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика)
	               |				ТОГДА ВТ_ТоварыДокумента.Количество * -1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КоличествоОтказПоставщика
	               |ИЗ
	               |	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя,
	               |	ВТ_ТоварыДокумента.Номенклатура,
	               |	ВТ_ТоварыДокумента.Документ";
	
	Возврат ТекстЗапроса;

КонецФункции                   

Функция ПолучитьТекстЗапросаГрузовоеМесто()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТоварыДокумента.Заказ КАК ЗаказПокупателя,
	|	ТоварыДокумента.Ссылка КАК Документ,
	|	ТоварыДокумента.Номенклатура,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	|ИЗ
	|	Документ.ГрузовоеМесто.Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка = &ДокументДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Заказ,
	|	ТоварыДокумента.Ссылка,
	|	ТоварыДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыДокумента.ЗаказПокупателя,
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	ВТ_ТоварыДокумента.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ВТ_ТоварыДокумента.Документ.Погружено
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.НаДоставке)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.НаПодборе)
	|	КОНЕЦ КАК Статус,
	|	ВЫБОР
	|		КОГДА ВТ_ТоварыДокумента.Документ.Погружено
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ТоварыДокумента.Количество
	|	КОНЕЦ КАК КоличествоКПогрузке,
	|	ВЫБОР
	|		КОГДА ВТ_ТоварыДокумента.Документ.Погружено
	|			ТОГДА ВТ_ТоварыДокумента.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличесвоНаДоставке
	|ИЗ
	|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента";     
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьТекстЗапросаСборкаЗаказовПокупателя()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТоварыДокумента.Заказ КАК ЗаказПокупателя,
	|	ТоварыДокумента.Ссылка КАК Документ,
	|	ТоварыДокумента.Номенклатура,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Заказано КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка = &ДокументДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Заказ,
	|	ТоварыДокумента.Ссылка,
	|	ТоварыДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыДокумента.ЗаказПокупателя,
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	ВТ_ТоварыДокумента.Документ КАК Документ,
	|	ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.НаПодборе) КАК Статус,
	|	ВТ_ТоварыДокумента.Количество КАК КоличествоСобрано
	|ИЗ
	|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента";	
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьТекстЗапросаЗаказПоставщику()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТоварыДокумента.Заказ КАК ЗаказПокупателя,
	|	ТоварыДокумента.Ссылка КАК Документ,
	|	ТоварыДокумента.Номенклатура,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка = &ДокументДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Заказ,
	|	ТоварыДокумента.Ссылка,
	|	ТоварыДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыДокумента.ЗаказПокупателя,
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	ВТ_ТоварыДокумента.Документ КАК Документ,
	|	ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.ЗаказаноПоставщику) КАК Статус,
	|	ВТ_ТоварыДокумента.Количество КАК КоличествоОжидается
	|ИЗ
	|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента";     
	
	Возврат ТекстЗапроса;

КонецФункции

//Контроль изменения данные в документе

Функция ЕстьРазличияЗаписей(ДокументПроверки)  
	
	ТаблицаДокумента = ДокументПроверки.Товары.Выгрузить();
	ТаблицаДокумента.Свернуть("Номенклатура", "Количество");  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЗаказаПокупателя.Номенклатура,
	|	СУММА(СтатусыЗаказаПокупателя.КоличествоОжидается) КАК Количество
	|ИЗ
	|	РегистрСведений.СтатусыЗаказаПокупателя КАК СтатусыЗаказаПокупателя
	|ГДЕ
	|	СтатусыЗаказаПокупателя.Документ = &Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыЗаказаПокупателя.Номенклатура";
	
	Запрос.УстановитьПараметр("Документ", ДокументПроверки);
	
	ТаблицаСверки = Запрос.Выполнить().Выгрузить();

	ТаблицаРазличий = РазницаТаблицЗначений(ТаблицаДокумента, ТаблицаСверки);
	
	Возврат ТаблицаРазличий.Количество() > 0; 
	
КонецФункции

Функция РазницаТаблицЗначений(ТаблицаИсходная, ТаблицаСравнения)
	
    ВсеКолонки = "";  
	
    Для Каждого Колонка Из ТаблицаИсходная.Колонки Цикл 
        ВсеКолонки = ВсеКолонки + ", " + Колонка.Имя
	КонецЦикла;   
	
    ВсеКолонки = Сред(ВсеКолонки, 2);
    
    Таблица = ТаблицаСравнения.Скопировать();    
    
    Таблица.Колонки.Добавить("Знак", Новый ОписаниеТипов("Число"));
    
    Таблица.ЗаполнитьЗначения(1, "Знак");
    
	Для Каждого Строка Из ТаблицаИсходная Цикл 
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Строка); 
	КонецЦикла;
    
    Таблица.Колонки.Добавить("Счётчик");
    Таблица.ЗаполнитьЗначения(1, "Счётчик");
    
    Таблица.Свернуть(ВсеКолонки, "Знак, Счётчик");
    
    ТаблицаРазличий = Таблица.Скопировать(Новый Структура("Счётчик", 1), ВсеКолонки + ", Знак");
    ТаблицаРазличий.Сортировать("Номенклатура");
    
    Возврат ТаблицаРазличий;   
    
КонецФункции
